Repository: Elarial/AutomationToolbox
Catalog: src/AutomationToolbox.Client/Resources/App.*.resx
Languages: fr

source: Home
fr: Accueil

source: Tools
fr: Outils

source: Weather
fr: Météo

# JsonFormatterTitle
source: JSON Formatter
fr: Formateur JSON

# JsonFormatterDesc
source: Format and validate JSON input.
fr: Formater et valider du JSON.

# GuidGeneratorTitle
source: GUID Generator
fr: Générateur de GUID

# GuidGeneratorDesc
source: Generate unique identifiers (GUIDs).
fr: Générer des identifiants uniques (GUIDs).

# Base64EncoderTitle
source: Base64 Encoder/Decoder
fr: Encodeur/Décodeur Base64

# Base64EncoderDesc
source: Encode or decode Base64 strings.
fr: Encoder ou décoder en Base64.

# NumberFormatConverterTitle
source: Number Format Converter
fr: Convertisseur de Nombres

# NumberFormatConverterDesc
source: Convert between binary, octal, decimal, hex, and IEEE 754.
fr: Convertir entre binaire, octal, décimal, hex et IEEE 754.

source: Add Converter
fr: Ajouter un convertisseur

source: Converter
fr: Convertisseur

source: Remove Converter
fr: Supprimer le convertisseur

source: Input Number
fr: Nombre en entrée

source: Binary
fr: Binaire

source: Decimal
fr: Décimal

source: Hexadecimal
fr: Hexadécimal

# IEEE754
source: Float (IEEE 754)
fr: Flottant (IEEE 754)

# NoConverters
source: No active converters. Click 'Add Converter' to start.
fr: Aucun convertisseur actif. Cliquez sur 'Ajouter un convertisseur' pour commencer.

# InvalidInput
source: Invalid input for {0}.
fr: Entrée invalide pour {0}.

# ValueOverflow
source: Overflow
fr: Dépassement

# IpScannerTitle
source: IP Scanner
fr: Scanner IP

# IpScannerDesc
source: Scan network for devices and open ports.
fr: Scanner le réseau pour découvrir des appareils et des ports ouverts.

source: Add Scanner
fr: Ajouter un scanner

source: Remove Scanner
fr: Supprimer le scanner

source: Network Interface
fr: Interface Réseau

# SelectInterface
source: Select an interface...
fr: Sélectionner une interface...

source: IP Range
fr: Plage IP

# Timeout
source: Timeout (ms)
fr: Délai (ms)

source: Start Scan
fr: Lancer le scan

source: Scanning...
fr: Scan en cours...

# ShowOffline
source: Show offline devices
fr: Afficher les appareils hors ligne

source: Results
fr: Résultats

# NoDevicesFound
source: No devices found in the selected range.
fr: Aucun appareil trouvé dans la plage sélectionnée.

source: Scan Ports
fr: Scanner les ports

# InvalidIpRange
source: Invalid IP Range format.
fr: Format de plage IP invalide.

# InvalidPortRange
source: Invalid Port Range format.
fr: Format de plage de ports invalide.

# NoScanners
source: No active scanners. Click 'Add Scanner' to start.
fr: Aucun scanner actif. Cliquez sur « Ajouter un scanner » pour commencer.
